{
  "products": [
    {
      "id": 1,
      "image": "assets/e_commerce_app/e_commerce_image/television.png",
      "name": "Monitor LG 22”inc 4K 120Fps",
      "description": "48” UHD 4K (3840 x 2160) OLED Display - Meet the next-level of gaming thanks to an ultra-large 48” monitor, for a game-changing, immersive experience.\n1.5M : 1 Contrast Ratio & DCI-P3 99% (Typ.) with HDR 10 - With a 1,500,000:1 contrast ratio, gamers will experience games the way the creators intended with bold colors.\n0.1ms (GtG) Response time - Enjoy the game with smoother movement, and surreal visual fluidity, with 0.1ms (GtG) response time that reduces reverse ghosting, and helps objects render clearly.\nHDMI 2.1 and VRR - Enjoy smoother, vivid colors and high-resolution graphics thanks to HDMI 2.1, which provides 2.5x higher bandwidth than HDMI 2.0. With HDMI 2.1 and a supportable graphics card, you can experience up to 120Hz (O/C 138Hz) variable refresh rate (VRR). You can also transfer uncompressed 4K files at speeds up to 120Hz and uncompressed 8K files at speeds up to 30Hz.\nNVIDIA G-SYNC Compatible - Get In The Game Officially validated by NVIDIA as G-SYNC Compatible**. That translates to faster, smoother gaming that's been tested to reduce screen tearing and stutter. Never miss a frame of the action as you clinch your victories.\nAMD FreeSync Premium - AMD FreeSync Premium is built in. AMD FreeSync Premium equips serious gamers with a fluid, virtually tear-free gaming experience. With at least 120hz refresh rate at minimum FHD resolution and low latency gameplay, you'll never miss a frame of the action as you play at peak performance.\nDTS Headphone:X - DTS Headphone:X provides accurate spatialization and localization in games for 3D audio over headphones. Supports channel-based, scene based, and object-based audio.\nUltraGear Remote Control - With the UltraGear Remote Control, you can turn your monitor on or off, adjust sound, change the mode and more.\nAnti-Glare & Low Reflection - Stay focused on the game without worrying about missing enemy movements from light reflections.",
      "price": 199.99,
      "color": [
        "0xffF5E3DF",
        "0xffECECEC",
        "0xffE4F2DF",
        "0xffD5E0ED",
        "0xff3E3D40"
      ],
      "inCart": false,
      "storeImage": "assets/e_commerce_app/e_commerce_image/lg.png",
      "storeName": "LG Store"
    },
    {
      "id": 2,
      "image": "assets/e_commerce_app/e_commerce_image/mug.png",
      "name": "Aestechic Mug - white variant",
      "description": "Size: 11 ounce White Ceramic coffee mug £¨Print on both sides£\nC-shaped handle, comfortable to hold,\nDurable ceramic material, safe and healthy for drinking\nCan be used for Hot & Cold beverages\n100% dishwasher, hand-wash and microwave proof\n",
      "price": 39.99,
      "color": [
        "0xffF1D7C0",
        "0xffECECEC",
        "0xffE4F2DF",
        "0xffD5E0ED",
        "0xffA2592D"
      ],
      "inCart": false,
      "storeImage": "assets/e_commerce_app/e_commerce_image/amazon.png",
      "storeName": "Amazon Store"
    },
    {
      "id": 3,
      "image": "assets/e_commerce_app/e_commerce_image/airpods3.png",
      "name": "Airpods pro",
      "description": "Active noise cancellation for immersive sound\nTransparency mode for hearing and connecting with the world around you\nThree sizes of soft, tapered silicone tips for a customizable fit\nSweat and water resistant\nAdaptive EQ automatically tunes music to the shape of your ear\nEasy setup for all your Apple devices\nQuick access to Siri by saying “Hey Siri”\nThe Wireless Charging Case delivers more than 24 hours of battery life",
      "price": 499.99,
      "color": [
        "0xffF1D7C0",
        "0xffECECEC",
        "0xffE4F2DF",
        "0xffD5E0ED",
        "0xffA2592D"
      ],
      "inCart": false,
      "storeImage": "assets/e_commerce_app/e_commerce_image/apple.png",
      "storeName": "Apple Store"
    },
    {
      "id": 4,
      "image": "assets/e_commerce_app/e_commerce_image/game.png",
      "name": "Playstation 4 - SSD 128 GB",
      "description": "Incredible games; Endless entertainment\nAll new lighter slimmer PS4\n128gb hard drive\nBlu-ray technology, delivers exceptional video quality\nRedefine your gaming expectations and immerse yourself in moments so intense your intuition takes over.",
      "price": 199.99,
      "color": [
        "0xffF1D7C0",
        "0xffECECEC",
        "0xffE4F2DF",
        "0xffD5E0ED",
        "0xffD65B5B"
      ],
      "inCart": false,
      "storeImage": "assets/e_commerce_app/e_commerce_image/amazon.png",
      "storeName": "Amazon Store"
    },
    {
      "id": 5,
      "image": "assets/e_commerce_app/e_commerce_image/shirt.png",
      "name": "T-shirt",
      "description": "100% Cotton\nImported\nPull On closure\n6 Pack Black Crew T-Shirts\nStays tucked with a Layflat Collar\nWicks moisture\n6 Pack Black & Grey Crew T-Shirts\n",
      "price": 79.99,
      "color": [
        "0xffF1D7C0",
        "0xffECECEC",
        "0xffE4F2DF",
        "0xffD5E0ED",
        "0xffA2592D"
      ],
      "inCart": false,
      "storeImage": "assets/e_commerce_app/e_commerce_image/amazon.png",
      "storeName": "Amazon Store"
    },
    {
      "id": 6,
      "image": "assets/e_commerce_app/e_commerce_image/mac.png",
      "name": "Macbook Pro - 8/128GB - With touchbar",
      "description": "Apple M1 Pro or M1 Max chip for a massive leap in CPU, GPU, and machine learning performance\nUp to 10-core CPU delivers up to 2x faster performance to fly through pro workflows quicker than ever\nUp to 32-core GPU with up to 4x faster performance for graphics-intensive apps and games\n16-core Neural Engine for up to 5x faster machine learning performance\nLonger battery life, up to 21 hours\nUp to 64GB of unified memory so everything you do is fast and fluid\nUp to 8TB of superfast SSD storage launches apps and opens files in an instant",
      "price": 1979.99,
      "color": [
        "0xff67C4A7",
        "0xffECECEC",
        "0xffE4F2DF",
        "0xffD5E0ED",
        "0xffA2592D"
      ],
      "inCart": false,
      "storeImage": "assets/e_commerce_app/e_commerce_image/apple.png",
      "storeName": "Apple Store"
    },
    {
      "id": 7,
      "image": "assets/e_commerce_app/e_commerce_image/camera.png",
      "name": "Fujifilm Camera XA5",
      "description": "Offering the ultimate image quality, X-T5 features the class-leading, 40.2-megapixel X-Trans 5 HR CMOS sensor in a compact, lightweight body that maximizes functionality and portability. X-T5’s improved image processing algorithm delivers outstanding results, packed with detail right across the native ISO range, which now extends to ISO 125. The classic X Series design has been retained. Dials predominate, making key functions – including ISO, shutter speed and exposure compensation – quick and easy to set, even with the camera switched off. X-T5 offers a new, 1.84 million dot, three-way tilting LCD and powerful in-body image stabilization.\nX-T5 provides powerful image making performance to ensure it’s ready for action, no matter how fast your subject is moving. A top electronic shutter speed of 1/180,000 sec and maximum mechanical shutter speed of 1/8000 sec will stop any subject in its tracks, while a lag time of just 35 ms gives almost instantaneous response when the shutter release is pressed. Keep a finger down, and X-T5 will record images at up to 15fps with the mechanical shutter, or 20fps with the electronic shutter. With the NP-W235 battery, up to 680 frames can be recorded from a single charge, plus the mechanical shutter guarantees 500,000 actuations, delivering long-term accuracy and reliability.\nThanks to X-T5’s in-body image stabilization (IBIS) system, camera shake will be a thing of the past – even in low-light conditions. It works in five axes, combatting all types of camera movement, and provides up to seven stops of compensation. IBIS works with the camera’s subject detection autofocus, which uses deep-learning AI to expertly track animals, birds, cars, motorcycles, planes and trains. Tracking moving subjects is made easier by the detailed electronic viewfinder (EVF), which uses 3.69 million dots to provide a bright, vibrant display. The EVF offers 0.8x magnification for an easy-to-view image. The 100fps refresh rate, meanwhile, allows virtually blackout-free image making.\nFollowing in the footsteps of X-H2, find the stunning Pixel Shift Multi-Shot mode in X-T5, delivering detailed files like never before. The feature utilizes the camera’s IBIS system to precisely shift the sensor, automatically recording 20 separate frames with one press of the shutter release. Resulting files are combined using Pixel Shift Combiner software to quadruple the camera’s resolution and produce a detail-rich, 160-megapixel file. Perfect for commercial applications or digital archiving, it’s also ideal for any static subject where image quality is of primary importance.\nX-T5’s capabilities are enhanced by its powerful video functions, which complement the camera’s impressive stills performance. Movies can be recorded internally at up to 6.2K/30p in 4:2:2 10-bit color, plus there’s a 4K HQ mode which oversamples 6.2K footage for superior 4K output. Both F-Log and F-Log2 recording are possible, the latter providing expanded dynamic range of 13+ stops, plus 12-bit Apple ProRes RAW and Blackmagic RAW can be output via HDMI, to Atomos and Blackmagic devices accordingly.",
      "price": 1699.99,
      "color": [
        "0xffF1D7C0",
        "0xffECECEC",
        "0xffE4F2DF",
        "0xffD5E0ED",
        "0xffA2592D"
      ],
      "inCart": false,
      "storeImage": "assets/e_commerce_app/e_commerce_image/amazon.png",
      "storeName": "Amazon Store"
    },

    {
      "id": 8,
      "image": "assets/e_commerce_app/e_commerce_image/hoodie.png",
      "name": "Hoodie",
      "description": "100% Polyester\nImported\nPull On closure\nMachine Wash\nMachine Washable in cold; Tumble Dry Low , Do Not Iron.\nClassic heavyweight hoodie in pill-resistant jersey featuring fleece-lined drawstring hood.\nMedium-weight 9 oz fleece with brushed interior offers exceptional softness and warmth with no shedding.\nFeature: Drawstring hoodie with kangaroo pocket featuring ribbed waistband and cuffs / Regular fit / Long sleeve / Contrast color / Drawstring with metal tips.\nTRENDY FASHION: These pull-over hoodies are the perfect finishing touch to any sporty or casual look, perfect for hanging out with friends, running errands, casual dates, school & more.",
      "price": 29.99,
      "color": [
        "0xff67C4A7",
        "0xffECECEC",
        "0xffE4F2DF",
        "0xffD5E0ED",
        "0xffA2592D"
      ],
      "inCart": false,
      "storeImage": "assets/e_commerce_app/e_commerce_image/amazon.png",
      "storeName": "Amazon Store"
    },
    {
      "id": 9,
      "image": "assets/e_commerce_app/e_commerce_image/max2.png",
      "name": "Air pods max by Apple",
      "description": "Active Noise Cancellation\nTransparency mode\nAdaptive EQ\nSpatial audio\nAvailable in five colors",
      "price": 549,
      "color": [
        "0xffF1D7C0",
        "0xffECECEC",
        "0xffE4F2DF",
        "0xffD5E0ED",
        "0xffA2592D"
      ],
      "inCart": false,
      "storeImage": "assets/e_commerce_app/e_commerce_image/apple.png",
      "storeName": "Apple Store"
    }
  ]
}